Plan status: `success`
<details>

```

[0m[1mazurerm_resource_group.spoke: Refreshing state... [id=/subscriptions/caa318eb-1d1b-4015-b096-195726de1378/resourceGroups/spoke-resources][0m
[0m[1mazurerm_network_security_group.spoke: Refreshing state... [id=/subscriptions/caa318eb-1d1b-4015-b096-195726de1378/resourceGroups/spoke-resources/providers/Microsoft.Network/networkSecurityGroups/spoke-security-group][0m
[0m[1mazapi_resource.ssh_public_key: Refreshing state... [id=/subscriptions/caa318eb-1d1b-4015-b096-195726de1378/resourceGroups/spoke-resources/providers/Microsoft.Compute/sshPublicKeys/sshkey-spoke-dev-eastus-001][0m
[0m[1mazurerm_virtual_network.spoke: Refreshing state... [id=/subscriptions/caa318eb-1d1b-4015-b096-195726de1378/resourceGroups/spoke-resources/providers/Microsoft.Network/virtualNetworks/spoke-network][0m
[0m[1mdata.azurerm_subnet.spoke_subnet1: Reading...[0m[0m
[0m[1mdata.azurerm_subnet.spoke_subnet1: Read complete after 0s [id=/subscriptions/caa318eb-1d1b-4015-b096-195726de1378/resourceGroups/spoke-resources/providers/Microsoft.Network/virtualNetworks/spoke-network/subnets/spoke_subnet1][0m
[0m[1mazurerm_network_interface.spoke: Refreshing state... [id=/subscriptions/caa318eb-1d1b-4015-b096-195726de1378/resourceGroups/spoke-resources/providers/Microsoft.Network/networkInterfaces/spoke-vm-nic][0m
[0m[1mazapi_resource_action.ssh_public_key_gen: Refreshing state... [id=/subscriptions/caa318eb-1d1b-4015-b096-195726de1378/resourceGroups/spoke-resources/providers/Microsoft.Compute/sshPublicKeys/sshkey-spoke-dev-eastus-001/generateKeyPair][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_linux_virtual_machine.spoke[0m will be created
[0m  [32m+[0m[0m resource "azurerm_linux_virtual_machine" "spoke" {
      [32m+[0m[0m admin_username                                         = "adminuser"
      [32m+[0m[0m allow_extension_operations                             = true
      [32m+[0m[0m bypass_platform_safety_checks_on_user_schedule_enabled = false
      [32m+[0m[0m computer_name                                          = (known after apply)
      [32m+[0m[0m disable_password_authentication                        = true
      [32m+[0m[0m disk_controller_type                                   = (known after apply)
      [32m+[0m[0m extensions_time_budget                                 = "PT1H30M"
      [32m+[0m[0m id                                                     = (known after apply)
      [32m+[0m[0m location                                               = "eastus"
      [32m+[0m[0m max_bid_price                                          = -1
      [32m+[0m[0m name                                                   = "example-machine"
      [32m+[0m[0m network_interface_ids                                  = [
          [32m+[0m[0m "/subscriptions/caa318eb-1d1b-4015-b096-195726de1378/resourceGroups/spoke-resources/providers/Microsoft.Network/networkInterfaces/spoke-vm-nic",
        ]
      [32m+[0m[0m patch_assessment_mode                                  = "ImageDefault"
      [32m+[0m[0m patch_mode                                             = "ImageDefault"
      [32m+[0m[0m platform_fault_domain                                  = -1
      [32m+[0m[0m priority                                               = "Regular"
      [32m+[0m[0m private_ip_address                                     = (known after apply)
      [32m+[0m[0m private_ip_addresses                                   = (known after apply)
      [32m+[0m[0m provision_vm_agent                                     = true
      [32m+[0m[0m public_ip_address                                      = (known after apply)
      [32m+[0m[0m public_ip_addresses                                    = (known after apply)
      [32m+[0m[0m resource_group_name                                    = "spoke-resources"
      [32m+[0m[0m size                                                   = "Standard_F2"
      [32m+[0m[0m virtual_machine_id                                     = (known after apply)
      [32m+[0m[0m vm_agent_platform_updates_enabled                      = false

      [32m+[0m[0m admin_ssh_key {
          [32m+[0m[0m public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9DPDUNGWfxMH+w2COVk97Qntm44oUhFOg/YZMnxytZEIiPLo/qIJJxoEcVey20O8JIf+4opRPOOsYIJLDxMgfN1q2Uxe5K1B8GEsrmQAY/XE8id9/OtCOw//Pa8EHRPQpSgrtKkO2VwORU83jymHgPfiObPBXjabu56P2C+MJIJLdgmY+0AJd5rRl+/58Gr3gvMWtYqwaMi27wZbI3Z+64q+6pxPiP6AzaP7DUpnHy3Tp4IjfD/aHSi12rrNOMKY4PUfjvYmBB3rdZeG8UMdPlRGnaEmGPhcwV/BkS+37M5ffeh+RE3N8hifS/BjRoEi8t+uccdbx8IoxjD+6IrOT/027rQ/qZs9QQY1uyRxa5Hm+GPvg2Qxcc4oYY5w/IIpfejQVGUCd0j95Tl7R73r+EZ71fKQ+xHb1n78x/WPzTSyhSvtyLvhauheuoNIvqW8LDpscoi5m2Lh5TNHbtuplwJbGa6UEiWoiYpU3tDUHq8eH0z3gaO3UAu/kiQ7z8iE= generated-by-azure"
          [32m+[0m[0m username   = "adminuser"
        }

      [32m+[0m[0m os_disk {
          [32m+[0m[0m caching                   = "ReadWrite"
          [32m+[0m[0m disk_size_gb              = (known after apply)
          [32m+[0m[0m name                      = (known after apply)
          [32m+[0m[0m storage_account_type      = "Standard_LRS"
          [32m+[0m[0m write_accelerator_enabled = false
        }

      [32m+[0m[0m source_image_reference {
          [32m+[0m[0m offer     = "0001-com-ubuntu-server-jammy"
          [32m+[0m[0m publisher = "Canonical"
          [32m+[0m[0m sku       = "22_04-lts"
          [32m+[0m[0m version   = "latest"
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: Production.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "Production.plan"

```

</details>

*Pusher: @satishkarengula, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*